app/Controllers/AuthController.php

    public function login()
    {
        // Récupérer les données postées depuis le formulaire
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Charger le modèle de l'utilisateur
        $userModel = new Admin();

        // Vérifier si l'utilisateur existe dans la base de données
        $user = $userModel->where('email', $email)->where('password',$password)->get();
---
SELECT *
FROM `admin`
WHERE `email` = 'zahira.boutmi@gmail.com'
AND `password` = 'qw'

    public function enregistrer(){
        $user = new Admin();
        $nomComplet = $this->request->getPost('nomComplet');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $Confirmpassword = $this->request->getPost('Cpass');
        if ($password == $Confirmpassword){
            $values = [
                'nom_complet' => $nomComplet,
                'email' => $email,
                'password'=> $password
            ];
            $query = $user->insert($values);
---
INSERT INTO `admin` (`nom_complet`, `email`, `password`) VALUES ('telaj med', 'telaj@gmail.com', 'telajtelaj')