app/Controllers/CreatingController.php

    public function generatedDevis($devis_id)
    {
        // Récupération des informations du devis dans la base de données
        $clientModel = new Client();
        $devis_info = $clientModel
        ->join('devis','devis.id_client = client.id_client')
        ->select('client.*,devis.*')
        ->where('devis.id_devis',$devis_id)
        ->get()->getResultArray();
---
SELECT `client`.*, `devis`.*
FROM `client`
JOIN `devis` ON `devis`.`id_client` = `client`.`id_client`
WHERE `devis`.`id_devis` = '06-002'