app/Controllers/CreatingController.php

    public function createData()
    {
        $factureModel = new Facture();
        $paimentModel = new Paiment();
        $relanceModel = new Relancement();
        $db = db_connect();

        // Démarre une transaction
        $db->transStart();

        try {
            $dataRelance = [
                'id_client' => $this->request->getPost('id_client')
            ];
            $relanceModel->insert($dataRelance);
            // Insère des données dans la table Facture
            $factureData = [
                'id_facture' => $this->request->getPost('id_facture'),
                'id_client' => $this->request->getPost('id_client'),
                'date_saisie' => $this->request->getPost('date_saisie'),
                'date_emission' => $this->request->getPost('date_emission'),
                'jours_apres_paiment' => 0,
                'date_echeance' => $this->request->getPost('date_echeance')
            ];
            $factureModel->insert($factureData);
---
INSERT INTO `relancement` (`id_client`) VALUES ('1')
INSERT INTO `facture` (`id_facture`, `id_client`, `date_saisie`, `date_emission`, `date_echeance`) VALUES ('05-001', '1', '2023-05-22', '2023-05-22', '2023-05-22')

                'status_litige' => $this->request->getPost('status_litige'),
                'status_paiment' => $this->request->getPost('status_paiment')
            ];
            $paimentModel->insert($paimentData);
---
INSERT INTO `paiment` (`id_facture`, `montant_paye`, `montant_rest`, `date_dernier_paiment`, `status`, `status_litige`, `status_paiment`) VALUES ('05-001', '1', '434.6', '2023-05-22', 'non Echue', 'commercial', 'paiement partiel')

    public function generatedDevis($devis_id)
    {
        // Récupération des informations du devis dans la base de données
        $clientModel = new Client();
        $devis_info = $clientModel
        ->join('devis','devis.id_client = client.id_client')
        ->select('client.*,devis.*')
        ->where('devis.id_devis',$devis_id)
        ->get()->getResultArray();
---
SELECT `client`.*, `devis`.*
FROM `client`
JOIN `devis` ON `devis`.`id_client` = `client`.`id_client`
WHERE `devis`.`id_devis` = '05-001'