app/Controllers/DevisController.php

SELECT *
FROM `client`
SELECT *
FROM `service`
---
    public function ajouterdevis()
    {
        $clientmodel = new Client;
        $servicemodel = new ServiceModel;
        $clients = $clientmodel->table('client')->get()->getResult();
        $services = $servicemodel->table('service')->get()->getResult();

SELECT `client`.*, `devis`.*
FROM `client`
JOIN `devis` ON `devis`.`id_client` = `client`.`id_client`
ORDER BY `devis`.`id_devis` DESC
SELECT `service`.`titre`, `lignecommande`.`description_service`, `lignecommande`.`prix_unitaire`, `lignecommande`.`qte_commande`
FROM `service`
JOIN `lignecommande` ON `service`.`id_service` = `lignecommande`.`id_service`
WHERE `lignecommande`.`id_devis` = '05-002'
---
    public function liste()
    {

        $modelService = new ServiceModel;
        $modelClient = new Client;
        // recupration de tous les donnees
        $columns = array('client.*', 'devis.*');
        $devis = $modelClient
        ->join('devis', 'devis.id_client = client.id_client')
        ->select($columns)
        ->orderBy('devis.id_devis', 'DESC')
        ->get()->getResultArray();
        $liste_devis = [];
        foreach ($devis as $dv) {
            $id=$dv['id_devis'];
            $columns = array('service.titre', 'lignecommande.description_service', 'lignecommande.prix_unitaire', 'lignecommande.qte_commande');
            $infos = $modelService->join('lignecommande', 'service.id_service = lignecommande.id_service')->
            select($columns)->
            where('lignecommande.id_devis',$id)->get()->getResultArray();

SELECT *
FROM `service`
WHERE `service`.`id_service` = '3'
---
    public function getServiceInfo($id_service)
    {
        // Récupération de la description et du prix du service dans la base de données
        $service = new ServiceModel();
        $service_info = $service->find($id_service);