app/Controllers/FactureController.php

SELECT `facture`.*, `client`.*, `paiment`.*, `devis`.*
FROM `client`
JOIN `devis` ON `devis`.`id_client` = `client`.`id_client`
JOIN `facture` ON `facture`.`id_client` = `client`.`id_client`
JOIN `paiment` ON `facture`.`id_facture` = `paiment`.`id_facture`
JOIN `lignecommande` ON `lignecommande`.`id_devis` = `devis`.`id_devis`
ORDER BY `facture`.`date_saisie` DESC
SELECT `service`.`titre`, `lignecommande`.`description_service`, `lignecommande`.`prix_unitaire`, `lignecommande`.`qte_commande`
FROM `service`
JOIN `lignecommande` ON `service`.`id_service` = `lignecommande`.`id_service`
WHERE `lignecommande`.`id_devis` = '05-001'
---
    public function index()
    {
        $session = session();
        $ServiceModel = new ServiceModel;
        $modelClient = new Client();
        // recupration de tous les donnees
        $columns = array('facture.*', 'client.*', 'paiment.*', 'devis.*');
        $resultat = $modelClient
            ->join('devis', 'devis.id_client = client.id_client')
            ->join('facture', 'facture.id_client = client.id_client')
            ->join('paiment', 'facture.id_facture = paiment.id_facture')
            ->join('lignecommande', 'lignecommande.id_devis = devis.id_devis')
            ->select($columns)->orderBy('facture.date_saisie', 'DESC')
            ->get()->getResultArray();

        $factures = [];

        foreach ($resultat as $facture) {
            $id = $facture['id_devis'];
            $columns = array('service.titre', 'lignecommande.description_service', 'lignecommande.prix_unitaire', 'lignecommande.qte_commande');
            $infos = $ServiceModel->join('lignecommande', 'service.id_service = lignecommande.id_service')
                ->select($columns)->where('lignecommande.id_devis', $id)->get()->getResultArray();

SELECT DISTINCT `client`.*, `facture`.*, `paiment`.*, `devis`.*
FROM `client`
JOIN `facture` ON `facture`.`id_client` = `client`.`id_client`
JOIN `paiment` ON `paiment`.`id_facture` = `facture`.`id_facture`
JOIN `devis` ON `client`.`id_client` = `devis`.`id_client`
WHERE `client`.`nom` LIKE '%boutmi zahira%' ESCAPE '!'
OR `facture`.`id_facture` = 'boutmi zahira'
OR `devis`.`total_ht` = 'boutmi zahira'
OR `devis`.`total_ttc` = 'boutmi zahira'
---
    public function search()
    {
        $keyword = $this->request->getVar('keyword'); // get the search keyword from the input field

        $db = db_connect(); // connect to the database

        // perform a join query between the `Client`, `Facture`, and `Paiment` tables
        $result = $db->table('client')
        ->join('facture', 'facture.id_client = client.id_client')
        ->join('paiment', 'paiment.id_facture = facture.id_facture')
        ->join('devis', 'client.id_client = devis.id_client')
        ->select('client.*, facture.*, paiment.*, devis.*')
        ->distinct() // Utilisez la méthode distinct() pour supprimer les doublons
        ->like('client.nom', $keyword)
        ->orWhere('facture.id_facture', $keyword)
        ->orWhere("devis.total_ht", $keyword)
        ->orWhere('devis.total_ttc', $keyword)
        ->get()
        ->getResultArray();