app/Controllers/RelanceController.php

SELECT `client`.*, `facture`.`id_facture`, `facture`.`relance_faite`
FROM `client`
JOIN `facture` ON `facture`.`id_client` = `client`.`id_client`
---
    public function Relance()
    {
        $session = session();

        // Vérifier si l'utilisateur est connecté en tant qu'admin
        if (!$session->get('nom_complet')) {
            return redirect()->to('/');
        }
        $db = db_connect(); // connect to the database

        // perform a join query between the `Client`, `Facture`, and `Paiment` tables
        $result = $db->table('client')
        ->join('facture', 'facture.id_client = client.id_client')
        ->select('client.*, facture.id_facture, facture.relance_faite')
        ->get()
        ->getResultArray();