app/Models/DevisModel.php

    public function generate_id_devis($dateSaisie)
    {
      // Get the month from the date_saisie
      $month = date('m', strtotime($dateSaisie));

      // Generate the prefix for the id_devis
      $prefix = $month .'-';

      // Get the maximum id_devis for the selected month
      $max_id_devis = $this->db->table('devis')
                                ->selectMax('id_devis')
                                ->where('SUBSTRING(id_devis, 1, 2)', $month)
                                ->get()
                                ->getRowArray()['id_devis'];
---
SELECT MAX(`id_devis`) AS `id_devis`
FROM `devis`
WHERE SUBSTRING(id_devis, 1, 2) = '09'