app/Models/Facture.php

    public function generate_id_facture($dateSaisie)
    {
      // Get the month from the date_saisie
      $month = date('m', strtotime($dateSaisie));

      // Generate the prefix for the id_facture
      $prefix = $month .'-';

      // Get the maximum id_facture for the selected month
      $max_id_facture = $this->db->table('Facture')
                                ->selectMax('id_facture')
                                ->where('SUBSTRING(id_facture, 1, 2)', $month)
                                ->get()
                                ->getRowArray()['id_facture'];
---
SELECT MAX(`id_facture`) AS `id_facture`
FROM `Facture`
WHERE SUBSTRING(id_facture, 1, 2) = '05'

      public function updateRelancement($id_facture, $relance_faite)
      {
          $this->where('id_facture', $id_facture)->set(['relance_faite' => $relance_faite])->update();
---
UPDATE `facture` SET `relance_faite` = 1
WHERE `id_facture` = '06-002'